app/Models/Barang_model.php

SELECT COUNT(*) AS `numrows`
FROM `tb_barang`
---
    public function count_all_barang()
    {
        $this->db = \Config\Database::connect();
        return $this->db->table('tb_barang')->countAllResults();